#Область ПрограммныйИнтерфейс

// Рассчитывает сумму строки табличной части по количеству и цене.
//
// Параметры:
//  СтрокаТабличнойЧасти - ДанныеФормыЭлементКоллекции - Строка табличной части с реквизитами Количество, Цена, Сумма.
//
Процедура РассчитатьСумму(СтрокаТабличнойЧасти) Экспорт
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
КонецПроцедуры

#КонецОбласти
