
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого СтрокаТовары Из Товары Цикл
		ДвижениеОстаткиТоваров = Движения.ОстаткиТоваров.Добавить();
		ДвижениеОстаткиТоваров.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеОстаткиТоваров.Период = Дата;
		ДвижениеОстаткиТоваров.Товар = СтрокаТовары.Товар;
		ДвижениеОстаткиТоваров.Количество = СтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти