#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		ДвижениеОстатковТоваров = Движения.ОстаткиТоваров.Добавить();
		ДвижениеОстатковТоваров.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеОстатковТоваров.Период = Дата;
		ДвижениеОстатковТоваров.Товар = СтрокаТовары.Товар;
		ДвижениеОстатковТоваров.Количество = СтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти